In [1]:
import pandas as pd

In [2]:
url = 'https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv'
b_name = pd.read_csv(url)

In [3]:
b_name.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [6]:
df = pd.read_excel("files/Data - Single Worksheet.xlsx")
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [8]:
pd.read_excel("files/Data - Multiple Worksheets.xlsx", sheet_name=1)

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [9]:
pd.read_excel("files/Data - Multiple Worksheets.xlsx", sheet_name="Data 2")

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [12]:
data = pd.read_excel("files/Data - Multiple Worksheets.xlsx", sheet_name=[0,1])
type(data)

collections.OrderedDict

In [19]:
data[0]

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [22]:
data[1]

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [25]:
girls = b_name[b_name["Gender"]=="FEMALE"]
boys = b_name[b_name["Gender"]=="MALE"]

In [27]:
excel_file = pd.ExcelWriter("Baby names.xlsx")

In [28]:
girls.to_excel(excel_file, sheet_name="Girls", index=False)
boys.to_excel(excel_file, sheet_name="Boys", index=False)

In [29]:
excel_file.save()